52n-sos-webapp/src/main/webapp/examples/sos_v20/requests_soap/Transactional/InsertSensor_OnlyProcID.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sosInsertSensor.xsd
http://www.opengis.net/swes/2.0 http://schemas.opengis.net/swes/2.0/swes.xsd" xmlns:swes="http://www.opengis.net/swes/2.0" xmlns:sos="http://www.opengis.net/sos/2.0" xmlns:swe="http://www.opengis.net/swe/1.0.1" xmlns:sml="http://www.opengis.net/sensorML/1.0.1" xmlns:gml="http://www.opengis.net/gml" xmlns:xlink="http://www.w3.org/1999/xlink">
	<env:Body>
		<swes:InsertSensor service="SOS" version="2.0.0">
			<swes:procedureDescriptionFormat>http://www.opengis.net/sensorML/1.0.1</swes:procedureDescriptionFormat>
			<swes:procedureDescription>	
				<sml:SensorML version="1.0.1">
		          <sml:member>
		            <sml:System>
		              <sml:identification>
		                <sml:IdentifierList>
		                  <sml:identifier name="uniqueID">
		                    <sml:Term definition="urn:ogc:def:identifier:OGC:uniqueID">
		                      <sml:value>http://www.my_namespace.org/sensors/101</sml:value>
		                    </sml:Term>
		                  </sml:identifier>
		                </sml:IdentifierList>
		              </sml:identification>
		              <capabilities name="parentProcedures">
		                <swe:SimpleDataRecord>
		                  <gml:metaDataProperty xlink:title="http://www.my_namespace.org/sensors/1821241365" xlink:href="http://localhost:8080/52nSOSv4.0.0/kvp?request=DescribeSensor&amp;service=SOS&amp;version=2.0.0&amp;procedure=http://www.my_namespace.org/sensors/1821241365&amp;procedureDescriptionFormat=http%3A%2F%2Fwww.opengis.net%2FsensorML%2F1.0.1"/>
		                </swe:SimpleDataRecord>
		              </capabilities>
		              <sml:position name="sensorPosition">
		                <swe:Position referenceFrame="urn:ogc:def:crs:EPSG::4326">
		                  <swe:location>
		                    <swe:Vector gml:id="STATION_LOCATION">
		                      <swe:coordinate name="easting">
		                        <swe:Quantity axisID="x">
		                          <swe:uom code="degree"/>
		                          <swe:value>7.727958</swe:value>
		                        </swe:Quantity>
		                      </swe:coordinate>
		                      <swe:coordinate name="northing">
		                        <swe:Quantity axisID="y">
		                          <swe:uom code="degree"/>
		                          <swe:value>51.883906</swe:value>
		                        </swe:Quantity>
		                      </swe:coordinate>
		                      <swe:coordinate name="altitude">
		                        <swe:Quantity axisID="z">
		                          <swe:uom code="m"/>
		                          <swe:value>52.0</swe:value>
		                        </swe:Quantity>
		                      </swe:coordinate>
		                    </swe:Vector>
		                  </swe:location>
		                </swe:Position>
		              </sml:position>
		              <sml:inputs>
		                <sml:InputList>
		                  <sml:input name="">
		                    <swe:ObservableProperty definition="http://sweet.jpl.nasa.gov/2.0/hydroSurface.owl#Discharge"/>
		                  </sml:input>
		                </sml:InputList>
		              </sml:inputs>
		              <sml:outputs>
		                <sml:OutputList>
		                  <sml:output name="">
		                    <swe:Quantity definition="http://sweet.jpl.nasa.gov/2.0/hydroSurface.owl#Discharge">
		                      <swe:uom code="NOT_DEFINED"/>
		                    </swe:Quantity>
		                  </sml:output>
		                </sml:OutputList>
		              </sml:outputs>
		              <sml:components>
		                <sml:ComponentList>
		                  <sml:component name="component1" xlink:title="http://www.my_namespace.org/sensors/676398562" xlink:role="childProcedure">
		                    <sml:System>
		                      <sml:identification>
		                        <sml:IdentifierList>
		                          <sml:identifier>
		                            <sml:Term definition="urn:ogc:def:identifier:OGC:uniqueID">
		                              <sml:value>http://www.my_namespace.org/sensors/676398562</sml:value>
		                            </sml:Term>
		                          </sml:identifier>
		                        </sml:IdentifierList>
		                      </sml:identification>
		                      <sml:position name="sensorPosition">
		                        <swe:Position referenceFrame="urn:ogc:def:crs:EPSG::4326">
		                          <swe:location>
		                            <swe:Vector gml:id="STATION_LOCATION">
		                              <swe:coordinate name="easting">
		                                <swe:Quantity axisID="x">
		                                  <swe:uom code="degree"/>
		                                  <swe:value>7.727958</swe:value>
		                                </swe:Quantity>
		                              </swe:coordinate>
		                              <swe:coordinate name="northing">
		                                <swe:Quantity axisID="y">
		                                  <swe:uom code="degree"/>
		                                  <swe:value>51.883906</swe:value>
		                                </swe:Quantity>
		                              </swe:coordinate>
		                              <swe:coordinate name="altitude">
		                                <swe:Quantity axisID="z">
		                                  <swe:uom code="m"/>
		                                  <swe:value>52.0</swe:value>
		                                </swe:Quantity>
		                              </swe:coordinate>
		                            </swe:Vector>
		                          </swe:location>
		                        </swe:Position>
		                      </sml:position>
		                      <sml:inputs>
		                        <sml:InputList>
		                          <sml:input name="">
		                            <swe:ObservableProperty definition="http://sweet.jpl.nasa.gov/2.0/hydroSurface.owl#Discharge"/>
		                          </sml:input>
		                        </sml:InputList>
		                      </sml:inputs>
		                      <sml:outputs>
		                        <sml:OutputList>
		                          <sml:output name="">
		                            <swe:Quantity definition="http://sweet.jpl.nasa.gov/2.0/hydroSurface.owl#Discharge">
		                              <swe:uom code="NOT_DEFINED"/>
		                            </swe:Quantity>
		                          </sml:output>
		                        </sml:OutputList>
		                      </sml:outputs>
		                    </sml:System>
		                  </sml:component>
		                </sml:ComponentList>
		              </sml:components>
		            </sml:System>
		          </sml:member>
		        </sml:SensorML>
			</swes:procedureDescription>
			<swes:observableProperty>http://sweet.jpl.nasa.gov/2.0/hydroSurface.owl#Discharge</swes:observableProperty>
			<swes:observableProperty>http://52north.org/def/obsProp/count</swes:observableProperty>
			<swes:observableProperty>http://52north.org/def/obsProp/category</swes:observableProperty>
			<swes:observableProperty>http://52north.org/def/obsProp/text</swes:observableProperty>
			<swes:observableProperty>http://52north.org/def/obsProp/boolean</swes:observableProperty>
			<swes:relatedFeature>
				<swes:FeatureRelationship>
					<swes:target xlink:href="http://52north.org/relatedFeature/100" />
					<swes:role>http://www.opengis.net/def/nil/OGC/0/unknown</swes:role>
				</swes:FeatureRelationship>
			</swes:relatedFeature>
			<swes:metadata>
				<sos:SosInsertionMetadata>
					<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_Measurement</sos:observationType>
					<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_CategoryObservation</sos:observationType>
					<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_CountObservation</sos:observationType>
					<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_TextObservation</sos:observationType>
					<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_TruthObservation</sos:observationType>
					<sos:featureOfInterestType>http://www.opengis.net/def/samplingFeatureType/OGC-OM/2.0/SF_SamplingPoint</sos:featureOfInterestType>
				</sos:SosInsertionMetadata>
			</swes:metadata>
		</swes:InsertSensor>
	</env:Body>
</env:Envelope>